tutorials/realFOAM/1D_C12H26_ECN_OP_8MPa_Paper/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }
    
    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    }

    hFinal
    {
         solver PBiCG;
	 preconditioner DILU;
	 $h;
	 tolerance 1e-06;
	 relTol    0;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.1;
    }

    pFinal
    {
        $p;
        tolerance        1e-6;
        relTol           0.0;
    }

    "(U|ha|hs|Yi)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(U|ha|hs|Yi)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
}

PISO
{
    transonic                   no;
    nCorrectors                 3;
    nNonOrthogonalCorrectors    0;
}

// ************************************************************************* //
